Repository: daobook/cpython
Catalog: locales/*/LC_MESSAGES/library/*.po
Languages: ast

source: Also, setting ``feature_version`` to a tuple ``(major, minor)`` will attempt to parse using that Python version's grammar. Currently ``major`` must equal to ``3``. For example, setting ``feature_version=(3, 4)`` will allow the use of ``async`` and ``await`` as variable names. The lowest supported version is ``(3, 4)``; the highest is ``sys.version_info[0:2]``.
ast: 另外，将 ``feature_version`` 设置为一个元组 ``(major, minor)`` 将尝试使用该 Python 版本的语法进行解析。目前 ``major`` 必须等于 ``3``。例如，设置 ``feature_version=(3, 4)`` 将允许使用 ``async`` 和 ``await`` 作为变量名。支持的最低版本是 ``(3, 4)``；最高版本是 ``sys.version_info[0:2]``。

source: If source contains a null character ('\0'), :exc:`ValueError` is raised.
ast: 如果 source 包含一个空字符（'\0'），:exc:`ValueError` 将被触发。

source: Note that successfully parsing source code into an AST object doesn't guarantee that the source code provided is valid Python code that can be executed as the compilation step can raise further :exc:`SyntaxError` exceptions. For instance, the source ``return 42`` generates a valid AST node for a return statement, but it cannot be compiled alone (it needs to be inside a function node).
ast: 注意，成功地将源代码解析成 AST 对象并不保证所提供的源代码是可以执行的有效 Python 代码，因为编译步骤可能会引发进一步的 :exc:`SyntaxError` 异常。例如，源码 ``return 42`` 为返回语句生成了一个有效的 AST 节点，但它不能被单独编译（它需要在一个函数节点内）。

source: In particular, :func:`ast.parse` won't do any scoping checks, which the compilation step does.
ast: 特别是，:func:`ast.parse` 不会做任何范围检查，而编译步骤会做。

source: It is possible to crash the Python interpreter with a sufficiently large/complex string due to stack depth limitations in Python's AST compiler.
ast: 足够复杂或是巨大的字符串可能导致 Python 解释器的崩溃，因为 Python 的 AST 编译器是有栈深限制的。

source: Added ``type_comments``, ``mode='func_type'`` and ``feature_version``.
ast: 增加了 ``type_comments``、``mode='func_type'`` 和 ``feature_version`` 。

source: Unparse an :class:`ast.AST` object and generate a string with code that would produce an equivalent :class:`ast.AST` object if parsed back with :func:`ast.parse`.
ast: 反向解析 :class:`ast.AST` 对象，并生成一个字符串，如果用 :func:`ast.parse` 解析，将产生一个等价的 :class:`ast.AST` 对象的代码。

source: The produced code string will not necessarily be equal to the original code that generated the :class:`ast.AST` object (without any compiler optimizations, such as constant tuples/frozensets).
ast: 产生的代码字符串不一定等于产生 :class:`ast.AST` 对象的原始代码（没有任何编译器优化，如常数 tuple/frozenset）。

source: Trying to unparse a highly complex expression would result with :exc:`RecursionError`.
ast: 试图解读一个高度复杂的表达式会导致 :exc:`RecursionError`。

source: Safely evaluate an expression node or a string containing a Python literal or container display. The string or node provided may only consist of the following Python literal structures: strings, bytes, numbers, tuples, lists, dicts, sets, booleans, ``None`` and ``Ellipsis``.
ast: 安全地评估一个表达式节点或一个包含 Python 字面量或容器显示的字符串。提供的字符串或节点只能由以下 Python 字面量结构组成：字符串、字节串、数字、元组、列表、字典、集合、布尔值、``None`` 和 ``Ellipsis``。

source: This can be used for safely evaluating strings containing Python values from untrusted sources without the need to parse the values oneself. It is not capable of evaluating arbitrarily complex expressions, for example involving operators or indexing.
ast: 这可以用来安全地评估来自不受信任的来源的包含 Python 值的字符串，而不需要自己去解析这些值。它不能够评估任意复杂的表达式，例如涉及运算符或索引的表达式。

source: It can raise :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` and :exc:`RecursionError` depending on the malformed input.
ast: 它可能引发 :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` 和 :exc:`RecursionError` ，取决于错误的输入。

source: Now allows bytes and set literals.
ast: 目前支持字节和集合。

source: Now supports creating empty sets with ``'set()'``.
ast: 现在支持用 ``'set()'`` 创建空集合。

source: For string inputs, leading spaces and tabs are now stripped.
ast: 对于字符串输入，前面的空格和制表符现在被剥离了。

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
ast: 返回给定 *node* 的文档字符串（必须是 :class:`FunctionDef`、:class:`AsyncFunctionDef`、:class:`ClassDef` 或 :class:`Module` 节点），如果没有文档字符串，则返回 ``None``。如果 *clean* 为真，则用 :func:`inspect.cleandoc` 清理该文档字符串的缩进。

source: :class:`AsyncFunctionDef` is now supported.
ast: 目前支持 :class:`AsyncFunctionDef` 。

source: Get source code segment of the *source* that generated *node*. If some location information (:attr:`lineno`, :attr:`end_lineno`, :attr:`col_offset`, or :attr:`end_col_offset`) is missing, return ``None``.
ast: 获取生成 *node* 的 *source* 的源代码段。如果某些位置信息（:attr:`lineno`、:attr:`end_lineno`、:attr:`col_offset` 或 :attr:`end_col_offset` ）丢失，返回 ``None``。

source: If *padded* is ``True``, the first line of a multi-line statement will be padded with spaces to match its original position.
ast: 如果 *padded* 是 ``True``，多行语句的第一行将被填充空格，以符合其原始位置。

source: When you compile a node tree with :func:`compile`, the compiler expects :attr:`lineno` and :attr:`col_offset` attributes for every node that supports them. This is rather tedious to fill in for generated nodes, so this helper adds these attributes recursively where not already set, by setting them to the values of the parent node. It works recursively starting at *node*.
ast: 当你用 :func:`compile` 编译一个节点树时，编译器期望 :attr:`lineno` 和 :attr:`col_offset` 的属性对每一个节点均支持。这对于生成的节点来说是相当繁琐的，所以这个帮助器在没有设置的地方递归地添加这些属性，将它们设置为父节点的值。它从 *node* 开始递归工作。

source: Increment the line number and end line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
ast: 将树中从 *node* 开始的每个节点的行号和末行号增加 *n*。这对 "移动代码" 到文件中的不同位置很有用。

source: Copy source location (:attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset`) from *old_node* to *new_node* if possible, and return *new_node*.
ast: 如果可能的话，从 *old_node* 复制源位置（ :attr:`lineno`、:attr:`col_offset`、:attr:`end_lineno` 和 :attr:`end_col_offset` ）到 *new_node*，并返回 *new_node*。

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
ast: 为 *node* 上存在的 ``node._fields`` 中的每个字段产生一个 ``(fieldname, value)`` 的元组。

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
ast: 产生 *node* 的所有直接子节点，即所有属于节点的字段和属于节点列表的字段的所有项目。

source: Recursively yield all descendant nodes in the tree starting at *node* (including *node* itself), in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
ast: 递归产生树中从 *node* 开始的所有后代节点（包括 *node* 本身），没有指定顺序。如果你只想就地修改节点，而不关心上下文，这很有用。

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
ast: 一个节点访问者基类，它行走在抽象的语法树上，为每个发现的节点调用一个访问者函数。这个函数可以返回一个值，由 :meth:`visit` 方法转发。

source: This class is meant to be subclassed, with the subclass adding visitor methods.
ast: 这个类是要被子类化的，子类会增加访问者方法。

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
ast: 访问一个节点。默认实现是调用 :samp:`self.visit_{classname}` 的方法，其中 *classname* 是节点类的名称，如果该方法不存在，则调用 :meth:`generic_visit`。

source: This visitor calls :meth:`visit` on all children of the node.
ast: 这个访问者在节点的所有子节点上调用 :meth:`visit`。

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
ast: 注意，拥有自定义访客方法的节点的子节点不会被访问，除非访客调用 :meth:`generic_visit` 或自己访问它们。

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
ast: 如果你想在遍历过程中对节点进行修改，请不要使用 :class:`NodeVisitor`。为此，存在一个特殊的访问者（:class:`NodeTransformer`），允许修改。

source: Methods :meth:`visit_Num`, :meth:`visit_Str`, :meth:`visit_Bytes`, :meth:`visit_NameConstant` and :meth:`visit_Ellipsis` are deprecated now and will not be called in future Python versions. Add the :meth:`visit_Constant` method to handle all constant nodes.
ast: 方法 :meth:`visit_Num`、:meth:`visit_Str`、:meth:`visit_Bytes`、:meth:`visit_NameConstant` 和 :meth:`visit_Ellipsis` 现在已经废弃，在未来的 Python 版本中不会被调用。添加 :meth:`visit_Constant` 方法来处理所有常数节点。

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
ast: 子类 :class:`NodeVisitor` 用于遍历抽象语法树，并允许修改节点。

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
ast: :class:`NodeTransformer` 将遍历抽象语法树并使用visitor方法的返回值去替换或移除旧节点。如果visitor方法的返回值为 ``None`` , 则该节点将从其位置移除，否则将替换为返回值。当返回值是原始节点时，无需替换。

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
ast: 如下是一个转换器示例，它将所有出现的名称 (``foo``) 重写为 ``data['foo']``::

source: Keep in mind that if the node you're operating on has child nodes you must either transform the child nodes yourself or call the :meth:`generic_visit` method for the node first.
ast: 请记住，如果您正在操作的节点具有子节点，则必须先转换其子节点或为该节点调用 :meth:`generic_visit` 方法。

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
ast: 对于属于语句集合（适用于所有语句节点）的节点，访问者还可以返回节点列表而不仅仅是单个节点。

source: If :class:`NodeTransformer` introduces new nodes (that weren't part of original tree) without giving them location information (such as :attr:`lineno`), :func:`fix_missing_locations` should be called with the new sub-tree to recalculate the location information::
ast: 如果 :class:`NodeTransformer` 引入了新的节点（不是原来树的一部分），而没有给它们位置信息（比如 :attr:`lineno`），那么 :func:`fix_missing_locations` 应该与新的子树一起调用，以重新计算位置信息 ::

source: Usually you use the transformer like this::
ast: 通常你可以像这样使用转换器 ::

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. If *annotate_fields* is true (by default), the returned string will show the names and the values for fields. If *annotate_fields* is false, the result string will be more compact by omitting unambiguous field names. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to true.
ast: 返回 *node* 中树的格式化转储。这主要是为了调试的目的。如果 *annotate_fields* 为 true（默认），返回的字符串将显示字段的名称和值。如果 *annotate_fields* 为 false，结果字符串将通过省略不明确的字段名而变得更加紧凑。默认情况下，诸如行号和列的偏移量等属性不会被转储。如果希望这样，可以将 *include_attributes* 设置为 true。

source: If *indent* is a non-negative integer or string, then the tree will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the single line representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ast: 如果 *indent* 是一个非负的整数或字符串，那么树就会以该缩进级别进行漂亮的打印。缩进级别为 0、负数或 ``""`` 将只插入新行。``None`` （默认）选择单行表示法。使用正的整数缩进，每一级有那么多的空格。如果 *indent* 是一个字符串（如 ``"\t"``），该字符串将用于缩进每一级。

source: Added the *indent* option.
ast: 添加 *indent* 选项。

source: Command-Line Usage
ast: 命令行用法

source: The following options are accepted:
ast: 可以接受以下选项：
