Repository: daobook/cpython
Catalog: locales/*/LC_MESSAGES/library/*.po
Languages: ast

source: :mod:`ast` --- Abstract Syntax Trees
ast: :mod:`ast` --- 抽象语法树

source: **Source code:** :source:`Lib/ast.py`
ast: **源代码：** :source:`Lib/ast.py`

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
ast: :mod:`ast` 模块帮助 Python 程序处理 Python 语法的抽象语法树。抽象语法或许会随着 Python 的更新发布而改变；该模块能够帮助理解当前语法在编程层面的样貌。

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
ast: 抽象语法树可通过将 :data:`ast.PyCF_ONLY_AST` 作为旗标传递给 :func:`compile` 内置函数来生成，或是使用此模块中提供的 :func:`parse` 辅助函数。返回结果将是一个对象树，其中的类都继承自 :class:`ast.AST`。抽象语法树可被内置的 :func:`compile` 函数编译为一个 Python 代码对象。

source: Abstract Grammar
ast: 抽象文法

source: The abstract grammar is currently defined as follows:
ast: 抽象文法目前定义如下：

source: Node classes
ast: 节点类

source: This is the base of all AST node classes. The actual node classes are derived from the :file:`Parser/Python.asdl` file, which is reproduced :ref:`below <abstract-grammar>`. They are defined in the :mod:`_ast` C module and re-exported in :mod:`ast`.
ast: 这是所有 AST 节点类的基类。实际上，这些节点类派生自 :file:`Parser/Python.asdl` 文件，其中定义的语法树示例 :ref:`如下 <abstract-grammar>`。它们在 C 语言模块 :mod:`_ast` 中定义，并被导出至 :mod:`ast` 模块。

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
ast: 抽象语法定义的每个左侧符号（比方说， :class:`ast.stmt` 或者 :class:`ast.expr`）定义了一个类。另外，在抽象语法定义的右侧，对每一个构造器也定义了一个类；这些类继承自树左侧的类。比如，:class:`ast.BinOp` 继承自 :class:`ast.expr`。对于多分支产生式（也就是"和规则"），树右侧的类是抽象的；只有特定构造器结点的实例能被构造。

source: Each concrete class has an attribute :attr:`_fields` which gives the names of all child nodes.
ast: 每个具体类都有个属性 :attr:`_fields`, 用来给出所有子节点的名字。

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
ast: 每个具体类的实例对它每个子节点都有一个属性，对应类型如文法中所定义。比如，:class:`ast.BinOp` 的实例有个属性 :attr:`left`，类型是 :class:`ast.expr`.

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
ast: 如果这些属性在文法中标记为可选（使用问号），对应值可能会是 ``None``。如果这些属性有零或多个（用星号标记），对应值会用 Python 的列表来表示。所有可能的属性必须在用 :func:`compile` 编译得到 AST 时给出，且是有效的值。

source: Instances of :class:`ast.expr` and :class:`ast.stmt` subclasses have :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset` attributes. The :attr:`lineno` and :attr:`end_lineno` are the first and last line numbers of source text span (1-indexed so the first line is line 1) and the :attr:`col_offset` and :attr:`end_col_offset` are the corresponding UTF-8 byte offsets of the first and last tokens that generated the node. The UTF-8 offset is recorded because the parser uses UTF-8 internally.
ast: :class:`ast.expr` 和 :class:`ast.stmt` 子类的实例有 :attr:`lineno`、:attr:`col_offset`、:attr:`end_lineno` 和 :attr:`end_col_offset` 属性。:attr:`lineno` 和 :attr:`end_lineno` 是源文本跨度的第一行和最后一行的编号（1-索引，所以第一行是 行1），而 :attr:`col_offset` 和 :attr:`end_col_offset` 是生成该节点的第一个和最后一个形符的相应 UTF-8 字节偏差。UTF-8 的偏移量被记录下来，因为分析器内部使用 UTF-8。

source: Note that the end positions are not required by the compiler and are therefore optional. The end offset is *after* the last symbol, for example one can get the source segment of a one-line expression node using ``source_line[node.col_offset : node.end_col_offset]``.
ast: 请注意，编译器不要求结束位置，因此是可选的。末端偏移量是在最后一个符号之后，例如可以用 ``source_line[node.col_offset : node.end_col_offset]`` 得到单行表达式节点的源片段。

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
ast: 类的构造器 :class:`ast.T` 像下面这样解析它的参数：

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
ast: 如果有位置参数，它们必须和 :attr:`T._fields` 中的元素一样多；他们会像这些名字的属性一样被赋值。

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
ast: 如果有关键字参数，它们必须被设为和给定值同名的属性。

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
ast: 比方说，要创建和填充节点 :class:`ast.UnaryOp`，你得用 ::

source: or the more compact ::
ast: 或者更紧凑点 ::

source: Class :class:`ast.Constant` is now used for all constants.
ast: 类 :class:`ast.Constant` 现用于所有常量。

source: Simple indices are represented by their value, extended slices are represented as tuples.
ast: 简单的索引用其值表示，扩展的切片用元组表示。

source: Old classes :class:`ast.Num`, :class:`ast.Str`, :class:`ast.Bytes`, :class:`ast.NameConstant` and :class:`ast.Ellipsis` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: 旧的类 :class:`ast.Num`、:class:`ast.Str`、:class:`ast.Bytes`、:class:`ast.NameConstant` 和 :class:`ast.Ellipsis` 仍然可用，但它们将在未来的 Python 版本中被删除。在此期间，实例化它们将返回一个不同类的实例。

source: Old classes :class:`ast.Index` and :class:`ast.ExtSlice` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: 旧的类 :class:`ast.Index` 和 :class:`ast.ExtSlice` 仍然可用，但它们将在未来的 Python 版本中被移除。在此期间，实例化它们将返回一个不同类的实例。

source: The descriptions of the specific node classes displayed here were initially adapted from the fantastic `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ project and all its contributors.
ast: 这里显示的具体节点类的描述最初是从神奇的 `绿色树蛇 <https://greentreesnakes.readthedocs.io/en/latest/>`__ 项目及其所有贡献者那里改编的。

source: Literals
ast: 字面值

source: A constant value. The ``value`` attribute of the ``Constant`` literal contains the Python object it represents. The values represented can be simple types such as a number, string or ``None``, but also immutable container types (tuples and frozensets) if all of their elements are constant.
ast: 一个常量值。``Constant`` 字面的 ``value`` 属性包含它所代表的 Python 对象。所代表的值可以是简单的类型，如数字、字符串或 ``None``，也可以是不可变的容器类型（tuple 和 frozenset），如果它们的所有元素都是常数的话。

source: Node representing a single formatting field in an f-string. If the string contains a single formatting field and nothing else the node can be isolated otherwise it appears in :class:`JoinedStr`.
ast: 代表 f-string 中单一格式化字段的节点。如果字符串包含一个单一的格式化字段，而没有其他内容，那么该节点可以被隔离，否则它将出现在 :class:`JoinedStr` 中。

source: ``value`` is any expression node (such as a literal, a variable, or a function call).
ast: ``value`` 是任何表达式节点（如字面值、变量或函数调用）。

source: ``conversion`` is an integer:
ast: ``conversion`` 是整数：

source: -1: no formatting
ast: -1：没有格式化

source: 115: ``!s`` string formatting
ast: 115：``!s`` 字符串格式化

source: 114: ``!r`` repr formatting
ast: 114：``!r`` repr 格式化

source: 97: ``!a`` ascii formatting
ast: 97：``!a`` ascii 格式化

source: ``format_spec`` is a :class:`JoinedStr` node representing the formatting of the value, or ``None`` if no format was specified. Both ``conversion`` and ``format_spec`` can be set at the same time.
ast: ``format_spec`` 是一个 :class:`JoinedStr` 节点，代表值的格式化，如果没有指定格式，则为 ``None``。``conversion`` 和 ``format_spec`` 都可以同时设置。

source: An f-string, comprising a series of :class:`FormattedValue` and :class:`Constant` nodes.
ast: f-string，包括一系列的 :class:`FormattedValue` 和 :class:`Constant` 节点。

source: A list or tuple. ``elts`` holds a list of nodes representing the elements. ``ctx`` is :class:`Store` if the container is an assignment target (i.e. ``(x,y)=something``), and :class:`Load` otherwise.
ast: 一个列表或元组。``elts`` 持有代表其元素的节点列表。如果容器是一个赋值目标（即 ``(x,y)=something``），``ctx`` 是 :class:`Store`，否则 :class:`Load`。

source: A set. ``elts`` holds a list of nodes representing the set's elements.
ast: 集合。``elts`` 持有代表该集合元素的节点列表。

source: A dictionary. ``keys`` and ``values`` hold lists of nodes representing the keys and the values respectively, in matching order (what would be returned when calling :code:`dictionary.keys()` and :code:`dictionary.values()`).
ast: 字典。``keys`` 和 ``values`` 分别持有代表其键和值的节点列表，顺序匹配（当调用 :code:`dictionary.keys()` 和 :code:`dictionary.values()` 时将会返回）。

source: When doing dictionary unpacking using dictionary literals the expression to be expanded goes in the ``values`` list, with a ``None`` at the corresponding position in ``keys``.
ast: 当使用字典字元进行字典解包时，要展开的表达式在 ``values`` 列表中，在 ``keys`` 的相应位置有一个 ``None`` 。

source: Variables
ast: 变量

source: A variable name. ``id`` holds the name as a string, and ``ctx`` is one of the following types.
ast: 变量名称。``id`` 持有作为字符串的名称，``ctx`` 是以下类型之一。

source: Variable references can be used to load the value of a variable, to assign a new value to it, or to delete it. Variable references are given a context to distinguish these cases.
ast: 变量引用可以用来加载变量的值、给它分配新的值或者删除它。变量引用被赋予一个上下文以区分这些情况。

source: A ``*var`` variable reference. ``value`` holds the variable, typically a :class:`Name` node. This type must be used when building a :class:`Call` node with ``*args``.
ast: ``*var`` 的变量引用。``value`` 持有变量，通常是一个 :class:`Name` 节点。当建立一个带有 ``*args`` 的 :class:`Call` 节点时，必须使用这种类型。

source: Expressions
ast: 表达式

source: When an expression, such as a function call, appears as a statement by itself with its return value not used or stored, it is wrapped in this container. ``value`` holds one of the other nodes in this section, a :class:`Constant`, a :class:`Name`, a :class:`Lambda`, a :class:`Yield` or :class:`YieldFrom` node.
ast: 当一个表达式，比如一个函数调用，本身作为一个语句出现，其返回值没有被使用或存储，它被包裹在这个容器中。``value`` 容纳本节中的一个其他节点，:class:`Constant`、:class:`Name`、:class:`Lambda`、:class:`Yield` 或 :class:`YieldFrom` 节点。

source: A unary operation. ``op`` is the operator, and ``operand`` any expression node.
ast: 一元运算。``op`` 是运算符，``operand`` 是任何表达式节点。

source: Unary operator tokens. :class:`Not` is the ``not`` keyword, :class:`Invert` is the ``~`` operator.
ast: 一元运算形符。:class:`Not` 是 ``not`` 关键字、:class:`Invert` 是 ``~`` 运算符。

source: A binary operation (like addition or division). ``op`` is the operator, and ``left`` and ``right`` are any expression nodes.
ast: 二元运算（如加法或除法）。``op`` 是运算符，``left`` 和 ``right`` 是任何表达式节点。

source: Binary operator tokens.
ast: 二元运算符的形符。

source: A boolean operation, 'or' or 'and'. ``op`` is :class:`Or` or :class:`And`. ``values`` are the values involved. Consecutive operations with the same operator, such as ``a or b or c``, are collapsed into one node with several values.
ast: 一个布尔运算，'or' 或 'and'。``op`` 是 :class:`Or` 或 :class:`And`。``values`` 是所涉及的值。具有相同操作符的连续操作，如 ``a or b or c``，会被折叠成一个具有几个值的节点。

source: This doesn't include ``not``, which is a :class:`UnaryOp`.
ast: 这不包括 ``not``，它是一个 :class:`UnaryOp`。

source: Boolean operator tokens.
ast: 布尔运算形符。

source: A comparison of two or more values. ``left`` is the first value in the comparison, ``ops`` the list of operators, and ``comparators`` the list of values after the first element in the comparison.
ast: 两个或多个值的比较。``left`` 是比较中的第一个值，``ops`` 是运算符的列表，``comparators`` 是比较中第一个元素之后的值列表。

source: Comparison operator tokens.
ast: 比较运算形符。

source: A function call. ``func`` is the function, which will often be a :class:`Name` or :class:`Attribute` object. Of the arguments:
ast: 一个函数调用。``func`` 是函数，通常是一个 :class:`Name` 或 :class:`Attribute` 对象。参数：

source: ``args`` holds a list of the arguments passed by position.
ast: ``args`` 持有一个由位置传递的参数列表。

source: ``keywords`` holds a list of :class:`keyword` objects representing arguments passed by keyword.
ast: ``keywords`` 持有一个 :class:`keyword` 对象的列表，代表由 keyword 传递的参数。

source: When creating a ``Call`` node, ``args`` and ``keywords`` are required, but they can be empty lists. ``starargs`` and ``kwargs`` are optional.
ast: 当创建一个 ``Call`` 节点时，``args`` 和 ``keywords`` 是必须的，但它们可以是空列表。``starargs`` 和 ``kwargs`` 是可选的。

source: A keyword argument to a function call or class definition. ``arg`` is a raw string of the parameter name, ``value`` is a node to pass in.
ast: 一个函数调用或类定义的关键字参数。``arg`` 是参数名称的原始字符串，``value`` 是要传入的节点。

source: An expression such as ``a if b else c``. Each field holds a single node, so in the following example, all three are :class:`Name` nodes.
ast: 一个表达式，如 ``a if b else c``。

source: Attribute access, e.g. ``d.keys``. ``value`` is a node, typically a :class:`Name`. ``attr`` is a bare string giving the name of the attribute, and ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to how the attribute is acted on.
ast: 属性访问，例如：``d.keys``。``value`` 是一个节点，通常是 :class:`Name`。``attr`` 是一个裸字符串，给出属性的名称，``ctx`` 是 :class:`Load`、:class:`Store` 或 :class:`Del`，根据属性的操作方式。

source: A named expression. This AST node is produced by the assignment expressions operator (also known as the walrus operator). As opposed to the :class:`Assign` node in which the first argument can be multiple nodes, in this case both ``target`` and ``value`` must be single nodes.
ast: 一个命名的表达式。这个 AST 节点是由赋值表达式运算符（也被称为海象运算符）产生的。相对于 :class:`Assign` 节点，其中第一个参数可以是多个节点，在这种情况下，``target`` 和 ``value`` 都必须是单个节点。

source: Subscripting
ast: 下标

source: A subscript, such as ``l[1]``. ``value`` is the subscripted object (usually sequence or mapping). ``slice`` is an index, slice or key. It can be a :class:`Tuple` and contain a :class:`Slice`. ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to the action performed with the subscript.
ast: 一个下标，例如 ``l[1]``。``value`` 是下标的对象（通常是序列或映射）。``slice`` 是一个索引、切片或键。它可以是一个 :class:`Tuple` 并包含一个 :class:`Slice`。``ctx`` 是 :class:`Load`、:class:`Store` 或 :class:`Del`，根据对下标执行的操作。

source: Regular slicing (on the form ``lower:upper`` or ``lower:upper:step``). Can occur only inside the *slice* field of :class:`Subscript`, either directly or as an element of :class:`Tuple`.
ast: 常规切片（形式为 ``lower:upper`` 或 ``lower:upper:step``）。只能出现在 :class:`subscript` 的 *slice* 字段内，可以直接出现，也可以作为 :class:`Tuple` 的一个元素出现。

source: Comprehensions
ast: 解析式

source: List and set comprehensions, generator expressions, and dictionary comprehensions. ``elt`` (or ``key`` and ``value``) is a single node representing the part that will be evaluated for each item.
ast: 列表和集合的解析式，生成器表达式和字典的解析式。``elt``（或 ``key`` 和 ``value``）是一个单一的节点，代表每个项将被评估的部分。

source: ``generators`` is a list of :class:`comprehension` nodes.
ast: ``generators`` 是一个 :class:`comprehension` 节点的列表。

source: One ``for`` clause in a comprehension. ``target`` is the reference to use for each element - typically a :class:`Name` or :class:`Tuple` node. ``iter`` is the object to iterate over. ``ifs`` is a list of test expressions: each ``for`` clause can have multiple ``ifs``.
ast: 在一个解析式中的一个 ``for`` 子句。``target`` 是每个元素的引用 - 通常是一个 :class:`Name` 或 :class:`Tuple` 节点。``iter`` 是要迭代的对象。``ifs`` 是测试表达式的列表：每个 ``for`` 子句可以有多个 ``ifs``。

source: ``is_async`` indicates a comprehension is asynchronous (using an ``async for`` instead of ``for``). The value is an integer (0 or 1).
ast: ``is_async`` 表示一个解析式是异步的（使用 ``async for`` 而不是 ``for``）。其值是一个整数（0 或 1）。

source: Statements
ast: 语句

source: An assignment. ``targets`` is a list of nodes, and ``value`` is a single node.
ast: 赋值。``targets`` 是一个节点列表，``value`` 是一个单一节点。

source: Multiple nodes in ``targets`` represents assigning the same value to each. Unpacking is represented by putting a :class:`Tuple` or :class:`List` within ``targets``.
ast: ``targets`` 中的多个节点代表给每个节点分配相同的值。解包是通过在 ``targets`` 内放置一个 :class:`Tuple` 或 :class:`List` 来表示。

source: ``type_comment`` is an optional string with the type annotation as a comment.
ast: ``type_comment`` 是一个可选的字符串，其中的类型注释是一个注释。

source: An assignment with a type annotation. ``target`` is a single node and can be a :class:`Name`, a :class:`Attribute` or a :class:`Subscript`. ``annotation`` is the annotation, such as a :class:`Constant` or :class:`Name` node. ``value`` is a single optional node. ``simple`` is a boolean integer set to True for a :class:`Name` node in ``target`` that do not appear in between parenthesis and are hence pure names and not expressions.
ast: 一个带有类型注释的赋值。``target`` 是一个单一的节点，可以是 :class:`Name`、:class:`Attribute` 或一个 :class:`Subscript`。``annotation`` 是注释，例如 :class:`Constant` 或 :class:`Name` 节点。``value`` 是一个单一的可选节点。``simple`` 是一个布尔整数，对于 ``target`` 中的 :class:`Name` 节点，设置为 True，不出现在括号之间，因此是纯名称，不是表达式。

source: Augmented assignment, such as ``a += 1``. In the following example, ``target`` is a :class:`Name` node for ``x`` (with the :class:`Store` context), ``op`` is :class:`Add`, and ``value`` is a :class:`Constant` with value for 1.
ast: 增强的赋值，如 ``a += 1``。在下面的例子中，``target`` 是 ``x`` 的一个 :class:`Name` 节点（有 :class:`Store` 上下文），``op`` 是 :class:`Add`，``value`` 是一个 :class:`Constant`，值为 1。

source: The ``target`` attribute cannot be of class :class:`Tuple` or :class:`List`, unlike the targets of :class:`Assign`.
ast: 与 :class:`Assign` 的 targets 不同，``target`` 属性不能是 :class:`Tuple` 或 :class:`List` 类。

source: A ``raise`` statement. ``exc`` is the exception object to be raised, normally a :class:`Call` or :class:`Name`, or ``None`` for a standalone ``raise``. ``cause`` is the optional part for ``y`` in ``raise x from y``.
ast: ``raise`` 语句。``exc`` 是要引发的异常对象，通常是 :class:`Call` 或 :class:`Name`，或 ``None`` 用于独立的 ``raise``。``cause`` 是 ``raise x from y`` 中 ``y`` 的可选部分。

source: An assertion. ``test`` holds the condition, such as a :class:`Compare` node. ``msg`` holds the failure message.
ast: 断言。``test`` 持有条件，例如 :class:`Compare` 节点。``msg`` 持有失败信息。

source: Represents a ``del`` statement. ``targets`` is a list of nodes, such as :class:`Name`, :class:`Attribute` or :class:`Subscript` nodes.
ast: 代表一个 ``del`` 语句。``targets`` 是一个节点列表，例如 :class:`Name`、:class:`Attribute` 或 :class:`Subscript` 的节点。

source: A ``pass`` statement.
ast: ``pass`` 语句。

source: Other statements which are only applicable inside functions or loops are described in other sections.
ast: 其他只适用于函数或循环内部的语句在其他章节中描述。

source: An import statement. ``names`` is a list of :class:`alias` nodes.
ast: 导入语句。``names`` 是一个 :class:`alias` 节点的列表。

source: Represents ``from x import y``. ``module`` is a raw string of the 'from' name, without any leading dots, or ``None`` for statements such as ``from . import foo``. ``level`` is an integer holding the level of the relative import (0 means absolute import).
ast: 代表 ``from x import y``。``module`` 是 'from' 名称的原始字符串，没有任何前导点，或 ``None`` 用于诸如 ``from . foo`` 的语句。``level`` 是一个整数，表示相对导入的级别（0 表示绝对导入）。

source: Both parameters are raw strings of the names. ``asname`` can be ``None`` if the regular name is to be used.
ast: 两个参数都是名字的原始字符串。如果要使用常规名称，``asname`` 可以是 ``None``。

source: Control flow
ast: 控制流

source: Optional clauses such as ``else`` are stored as an empty list if they're not present.
ast: 像 ``else`` 这样的可选子句，如果不存在，就会被存储为一个空列表。

source: An ``if`` statement. ``test`` holds a single node, such as a :class:`Compare` node. ``body`` and ``orelse`` each hold a list of nodes.
ast: ``if`` 语句。``test`` 持有一个节点，例如 :class:`Compare` 节点。``body`` 和 ``orelse`` 分别持有一个节点的列表。

source: ``elif`` clauses don't have a special representation in the AST, but rather appear as extra :class:`If` nodes within the ``orelse`` section of the previous one.
ast: ``elif`` 子句在 AST 中没有特殊的表示方法，而是作为额外的 :class:`If` 节点出现在前一个子句的 ``orelse`` 部分。

source: A ``for`` loop. ``target`` holds the variable(s) the loop assigns to, as a single :class:`Name`, :class:`Tuple` or :class:`List` node. ``iter`` holds the item to be looped over, again as a single node. ``body`` and ``orelse`` contain lists of nodes to execute. Those in ``orelse`` are executed if the loop finishes normally, rather than via a ``break`` statement.
ast: ``for`` 循环。``target`` 持有循环指定的变量，作为一个单独的 :class:`Name`、:class:`Tuple` 或 :class:`List` 节点。``iter`` 持有要被循环的项目，同样是一个节点。``body`` 和 ``orelse`` 包含要执行的节点列表。如果循环正常结束，``orelse`` 中的节点将被执行，而不是通过 ``break`` 语句。

source: A ``while`` loop. ``test`` holds the condition, such as a :class:`Compare` node.
ast: ``while`` 循环。``test`` 持有条件，例如 :class:`Compare` 节点。

source: The ``break`` and ``continue`` statements.
ast: ``break`` 和 ``continue`` 语句。

source: ``try`` blocks. All attributes are list of nodes to execute, except for ``handlers``, which is a list of :class:`ExceptHandler` nodes.
ast: ``try`` 块。所有属性都是要执行的节点列表，除了 ``handlers``，它是 :class:`ExceptHandler` 节点的列表。

source: A single ``except`` clause. ``type`` is the exception type it will match, typically a :class:`Name` node (or ``None`` for a catch-all ``except:`` clause). ``name`` is a raw string for the name to hold the exception, or ``None`` if the clause doesn't have ``as foo``. ``body`` is a list of nodes.
ast: 一个单一的 ``except`` 子句。``type`` 是它要匹配的异常类型，通常是 :class:`Name` 节点（或者 ``None`` 是一个全面的 ``except:`` 子句）。``name`` 是一个原始字符串，用于保存异常的名称，如果子句中没有 ``as foo``，则为 ``None``。``body`` 是一个节点的列表。

source: A ``with`` block. ``items`` is a list of :class:`withitem` nodes representing the context managers, and ``body`` is the indented block inside the context.
ast: ``with`` 块。``items`` 是一个代表上下文管理者的 :class:`withitem` 节点的列表，``body`` 是上下文中缩进的块。

source: A single context manager in a ``with`` block. ``context_expr`` is the context manager, often a :class:`Call` node. ``optional_vars`` is a :class:`Name`, :class:`Tuple` or :class:`List` for the ``as foo`` part, or ``None`` if that isn't used.
ast: ``with`` 区块中的单个上下文管理器。``context_expr`` 是上下文管理器，通常是一个 :class:`Call` 节点。``optional_vars`` 是 :class:`Name`、:class:`Tuple` 或 :class:`List` 的 ``as foo`` 部分，如果不使用，则为 ``None``。

source: :mod:`ast` Helpers
ast: :mod:`ast` 中的辅助工具

source: Apart from the node classes, the :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
ast: 除了节点类， :mod:`ast` 模块里为遍历抽象语法树定义了这些工具函数和类：

source: Parse the source into an AST node. Equivalent to ``compile(source, filename, mode, ast.PyCF_ONLY_AST)``.
ast: 把 source 解析为 AST 节点。和 ``compile(source, filename, mode,ast.PyCF_ONLY_AST)`` 等价。

source: If ``type_comments=True`` is given, the parser is modified to check and return type comments as specified by :pep:`484` and :pep:`526`. This is equivalent to adding :data:`ast.PyCF_TYPE_COMMENTS` to the flags passed to :func:`compile()`. This will report syntax errors for misplaced type comments. Without this flag, type comments will be ignored, and the ``type_comment`` field on selected AST nodes will always be ``None``. In addition, the locations of ``# type: ignore`` comments will be returned as the ``type_ignores`` attribute of :class:`Module` (otherwise it is always an empty list).
ast: 如果给定 ``type_comments=True``，解析器会被修改，以检查并返回 :pep:`484` 和 :pep:`526` 所指定的类型注释。这相当于将 :data:`ast.PyCF_TYPE_COMMENTS` 添加到传递给 :func:`compile()` 的标志中。这将报告错误的类型注释的语法错误。如果没有这个标志，类型注释将被忽略，选定的 AST 节点上的 ``type_comment`` 字段将一直是 ``None``。此外，``# type: ignore`` 注释的位置将作为 :class:`Module` 的 ``type_ignores`` 属性返回（否则它总是一个空列表）。

source: In addition, if ``mode`` is ``'func_type'``, the input syntax is modified to correspond to :pep:`484` "signature type comments", e.g. ``(str, int) -> List[str]``.
ast: 此外，如果 ``mode`` 是 ``'func_type'``，输入语法将被修改为对应于 :pep:`484` 签名类型注释，例如 ``(str, int) -> List[str]``。
